app/Controllers/Home.php

INSERT INTO `user` (`name`, `email`, `password`, `profile_photo`) VALUES ('Abhishek Kumar', 'Vega6@gmail.com', '$2y$10$JhqwWXAsmfBZ/BBlwvoR/OPXo4BQdxwn2xrjcEFTslxoCgVU.pT4W', NULL)
---
    public function register_user() {
        $request = $this->request;
        $status = true;
        $message = 'Registration Successful';

        if (isset($_FILES['profilePhoto']) && $_FILES['profilePhoto']['error'] === UPLOAD_ERR_OK) {
            $profilePhotoData = file_get_contents($_FILES['profilePhoto']['tmp_name']);
        } else {
            $profilePhotoData = null;
        }

            $data = [
                'name' => $request->getPost('name'),
                'email' => $request->getPost('email'),
                'password' => password_hash($request->getPost('password'), PASSWORD_DEFAULT),
                'profile_photo' => $profilePhotoData, // Store the binary data in the column
            ];

            try {
                $this->userModel->insert($data);

UPDATE `user` SET `profile_photo` = '1694835832_63bdf87bd1f183fe70df.jpeg'
WHERE `user`.`id` IN ('15')
---
        // Check if the new profile picture name is different from the current value
        if ($newName !== $user['profile_photo']) {
            // Update the user's profile picture path in the database
            $userModel->update($user['id'], ['profile_photo' => $newName]);