app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `id` = '23'
 LIMIT 1
---
    public function getUserById($userId)
    {
        // Implement your database query here to fetch user data by ID
        return $this->where('id', $userId)->first();